Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [6]:
data=[4,8,15,16,23,42]
series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
l=[1,2,3,4,5,6,7,8,9,10]
Series=pd.Series(l)
print(Series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female


Then, print the DataFrame.

In [4]:
data={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']}
df=pd.DataFrame(data)
print(df)
type(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional, tabular data structure that is commonly used to store and manipulate data. It is similar to a spreadsheet or a SQL table and consists of rows and columns. Each column in a DataFrame can have a different data type, making it a versatile data structure for various types of data. You can think of a DataFrame as a collection of Pandas Series, where each column is a Series.

On the other hand, a Pandas Series is a one-dimensional labeled array capable of holding data of any data type. It is like a single column in a DataFrame. A Series has a label (or index) associated with each element, which can be used for data retrieval and alignment.

In [13]:
series_data=pd.Series([1,2,3,4],name='amar')
print("Pandas Series:")
print(series_data)

Pandas Series:
0    1
1    2
2    3
3    4
Name: amar, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

1)Selection and Indexing

In [14]:
print(df['Name'])

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [15]:
df.iloc[0]

Name       Alice
Age           25
Gender    Female
Name: 0, dtype: object

2)Filtering

In [16]:
df[df['Age']>25]

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

3)Sorting

In [17]:
df.sort_values('Age')

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

4)Aggregation and Grouping

In [18]:
df.groupby('Age').aggregate({'Age':'mean'})

      Age
Age
25   25.0
27   27.0
30   30.0

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, the Series and DataFrame are mutable, while the Panel is not.

Series: You can modify the elements within a Pandas Series after it has been created. You can change values, add new elements, and remove elements from a Series.

DataFrame: DataFrames are also mutable, meaning you can modify the data in the DataFrame. You can update, add, or delete rows and columns in a DataFrame.

On the other hand, Panel used to be a data structure in earlier versions of Pandas for handling three-dimensional data. However, the Panel data structure has been deprecated, and it's no longer a part of the main Pandas library as of Pandas version 0.25.0. It has been replaced by the more versatile MultiIndex DataFrames and Panel operations can be achieved using DataFrames with multi-level indexing, which are more flexible and powerful.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [5]:
name_series=pd.Series(['Amar','Aman','Annu'])
age_series=pd.Series([18,19,20])
gender_series=pd.Series(['Male','Male','Female'])

In [7]:
data={
    'Name':name_series,
    'Age':age_series,
    'Gender':gender_series}
df=pd.DataFrame(data)
print(df)

   Name  Age  Gender
0  Amar   18    Male
1  Aman   19    Male
2  Annu   20  Female